EMAIL, PASSWORD, ACCESS = 0, 1, 2

GROUP_1 = -1001869016733
GROUP_2 = -1001811351703
GROUP_3 = -1001634731374

HELLO_TEXT = """
Добрый день. Вас приветствует бот Перемен.

⚠️ Внимательно знакомьтесь с инструкцией перед регистрацией.

Её можно найти по ссылке: https://eraperemen.info/wp-content/uploads/2022/12/instrukcziya.pdf


⚠️ Избегайте распространенных ошибок

1. Какая у вас почта в бусти не важно.
2. Для того что бы получить доступ на сайт вам необходимо ЧЕТКО следовать описанным ниже шагам;
2.1. Оплата на Boosty
2.2. Попадаете в группу
2.3. Находите бота в группе или по ссылке https://t.me/vremya_peremen_admin_bot
2.4. Нажимаете зарегистрироваться, вводите почту (не обязательно с Boosty),
2.5. Придумываете свой пароль
2.6. Поздравляю ⭐️ Вы зарегистрированы на сайте eraperemen.info

⚠️ Если не сработало

Выйди из чата и снова зайти. Проделать все что описано выше еще раз
"""

PASSWORD_TEXT = """
🔐 Придумайте  пароль
Для отмены нажмите или пропишите /cancel.

💭 Придумайте надежный пароль (123456 не подойдет😊). После вы сможете восстановить его на сайте .
"""

EMAIL_TEXT = """
✉️ Напишите ваш email

Для отмены действия регистрации нажмите или пропишите  /cancel

💭 E-mail может быть любым. Не обязательно тот, что вы указали на Boosty. С помощью этой почты, по окончанию регистрации, вы сможете войти на сайт.
"""

EMAIL_TEXT_CHECK = """
✉️ Напишите ваш email для проверки доступа

💭 Вы должны быть зарегистрированы на сайте и должна быть оплачена подписка. Введите вашу почту и вы получите доступ в группу.
"""

HELP_TEXT = """
🔧 Если у Вас возникли какие-то проблемы обратитесь в поддержку в телеграмм  @supporterafinans

💭Хотим обратить ваше внимание что мы пока находимся на стадии тестирования нового сервиса. Будем благодарны за отзывы и понимание.
"""

DENY_TEXT = """
❌ У вас нет доступа

Обратитесь в поддержку @supporterafinans
"""
